#### 📖 Terraform Plan ('infra/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ai_search.azurerm_private_endpoint.srch must be replaced
-/+ resource "azurerm_private_endpoint" "srch" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-pep-01" -> (known after apply)
      ~ name                     = "io-p-itn-svc-pep-01" -> "io-p-itn-svc-srch-pep-01" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-svc-pep-01.nic.fff77c6f-10f0-474c-b589-2e82fd94b00d"
              - name = "io-p-itn-svc-pep-01.nic.fff77c6f-10f0-474c-b589-2e82fd94b00d"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-pep-01/privateDnsZoneGroups/io-p-itn-svc-dns-zone-group-01/privateDnsZoneConfigs/privatelink.search.windows.net"
              - name                = "privatelink.search.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-svc-srch-01.privatelink.search.windows.net"
                      - ip_addresses = [
                          - "10.20.2.4",
                        ]
                      - name         = "io-p-itn-svc-srch-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-pep-01/privateDnsZoneGroups/io-p-itn-svc-dns-zone-group-01" -> (known after apply)
            name                 = "io-p-itn-svc-dns-zone-group-01"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-svc-srch-01"
          ~ private_ip_address             = "10.20.2.4" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.function_app.module.app_be_fn.data.azurerm_function_app_host_keys.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_function_app_host_keys" "this" {
      + blobs_extension_key             = (sensitive value)
      + default_function_key            = (sensitive value)
      + durabletask_extension_key       = (sensitive value)
      + event_grid_extension_config_key = (sensitive value)
      + event_grid_extension_key        = (sensitive value)
      + id                              = (known after apply)
      + name                            = "io-p-itn-svc-app-be-fn-01"
      + primary_key                     = (sensitive value)
      + resource_group_name             = "io-p-itn-svc-rg-01"
      + signalr_extension_key           = (sensitive value)
      + webpubsub_extension_key         = (sensitive value)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01"
        name                                           = "io-p-itn-svc-app-be-fn-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
            # (27 unchanged attributes hidden)

          - ip_restriction {
              - action      = "Allow" -> null
              - description = "Allow Everything Temp" -> null
              - headers     = [] -> null
              - ip_address  = "0.0.0.0/0" -> null
              - name        = "Allow Everything Temp" -> null
              - priority    = 65000 -> null
            }

            # (4 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
